pinkymaxou/powered-soapbox-car/firmware/sdkconfig.defaults
# Réglages par défaut du projet (cible ESP32)
CONFIG_IDF_TARGET="esp32"

# Boucle de contrôle à 500 Hz → tick FreeRTOS à 1 kHz
CONFIG_FREERTOS_HZ=1000

# IPv6 : pile activée + autoconfig SLAAC (adresse globale en plus du link-local)
CONFIG_LWIP_IPV6=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# Taille réelle de la flash de la carte (ESP32-WROOM 4 Mo)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Table de partitions custom : Wi-Fi + Bluetooth → app ~2,75 Mo (flash 4 Mo), sans OTA
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth (manette via Bluepad32/BTstack) + coexistence Wi-Fi/BT (radio partagée)
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y
CONFIG_BTDM_CTRL_MODE_BTDM=y
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=5
CONFIG_BTDM_CTRL_BLE_MAX_CONN=5
CONFIG_BTDM_CTRL_MODEM_SLEEP=n
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# Wi-Fi + BT + coexistence saturent l'IRAM : on déplace le code Wi-Fi optimisé en flash
# (petite perte de débit Wi-Fi, sans impact sur la commande de la manette/des moteurs).
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# Bluepad32
# RAM diet (2026-07-31, see doc/audit-2026-07.md): a one-gamepad kart does not need a
# 4-gamepad table (~5.8 kB of DRAM each), 10 Wi-Fi static RX buffers (1.6 kB each), or
# 5.7 kB TCP buffers per socket — the page-load burst used to drive the heap under 1 kB.
# chart.js (69 kB) still serves in ~0.5 s with the halved TCP buffers.
CONFIG_BLUEPAD32_MAX_DEVICES=2
CONFIG_BLUEPAD32_PLATFORM_CUSTOM=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_WND_DEFAULT=2880
CONFIG_BTSTACK_AUDIO=n

# Support WebSocket dans le serveur HTTP
CONFIG_HTTPD_WS_SUPPORT=y

# mDNS (composant géré espressif/mdns) — publie « kart.local » + le service _http._tcp.
# Réglages au plus juste : 2 interfaces (AP + STA, pas d'Ethernet), 1 seul service,
# et pas de CLI de debug (économise de la flash).
CONFIG_MDNS_MAX_INTERFACES=2
CONFIG_MDNS_MAX_SERVICES=2
CONFIG_MDNS_PREDEF_NETIF_ETH=n
CONFIG_MDNS_ENABLE_CONSOLE_CLI=n
CONFIG_MDNS_MULTIPLE_INSTANCE=n

# Watchdog de tâche : 5 s. La boucle de contrôle s'y abonne et le réarme ;
# si elle se bloque > 5 s, le panic déclenché redémarre l'ESP32.
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=2
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
# Sur panic (dont watchdog) → redémarrage automatique
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y

# C++ : pas d'exceptions/RTTI (taille)
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
